Terraform plan result:

```
data.aws_s3_bucket.lambda_code: Reading...
aws_ssm_parameter.db_connect_string_param: Refreshing state... [id=/emenu/dev/db_connection_string]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_cloudwatch_log_group.presigned_url_generator_logs: Refreshing state... [id=/aws/lambda/emenu-presigned-url-generator-dev]
aws_iam_role.presigned_url_role: Refreshing state... [id=presigned-url-role-dev]
aws_cloudwatch_log_group.image_processor_logs: Refreshing state... [id=/aws/lambda/emenu-image-processor-dev]
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_s3_bucket.restaurant_assets: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role.image_processor_role: Refreshing state... [id=image-processor-role-dev]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250929095628385500000001]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250929095628385500000002]
aws_iam_role_policy.emenu_server_ses_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ses_access]
data.aws_s3_bucket.lambda_code: Read complete after 1s [id=emenu-lambda-code-bucket]
data.aws_s3_object.layer_code: Reading...
data.aws_s3_object.presigned_url_generator_code: Reading...
data.aws_s3_object.emenu_post_confirmation_code: Reading...
data.aws_s3_object.image_processor_code: Reading...
data.aws_s3_object.emenu_server_code: Reading...
aws_iam_role_policy.emenu_server_ssm_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ssm_access]
aws_iam_role_policy.emenu_post_confirmation_ssm_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:emenu_post_confirmation_ssm_access]
data.aws_s3_object.presigned_url_generator_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/presigned_url_generator/presigned_url_generator.zip]
data.aws_s3_object.layer_code: Read complete after 1s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:34]
data.aws_s3_object.emenu_server_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/emenu_server/emenu_server.zip]
data.aws_s3_object.image_processor_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/image_processor/image_processor.zip]
data.aws_s3_object.emenu_post_confirmation_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/emenu_post_confirmation/emenu_post_confirmation.zip]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_cognito_user_pool.emenu_user_pool: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ]
aws_s3_bucket_versioning.restaurant_assets_versioning: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_cors_configuration.restaurant_assets_cors: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role_policy.presigned_url_policy: Refreshing state... [id=presigned-url-role-dev:presigned-url-policy-dev]
aws_s3_bucket_server_side_encryption_configuration.restaurant_assets_encryption: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role_policy.image_processor_policy: Refreshing state... [id=image-processor-role-dev:image-processor-policy-dev]
aws_s3_bucket_public_access_block.restaurant_assets_pab: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_lambda_function.image_processor: Refreshing state... [id=emenu-image-processor-dev]
aws_lambda_function.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_policy.restaurant_assets_policy: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_cognito_user_pool_client.emenu_app_client: Refreshing state... [id=19kbapekjfmn2jkue74baferh5]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_cognito_user_group.waiter_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/waiter]
aws_cognito_user_pool_client.emenu_web_client: Refreshing state... [id=4l90vqi7nfam318ci1tml91j3n]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_cognito_user_group.demo_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/demo]
aws_cognito_user_group.boss_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/boss]
aws_iam_role_policy.emenu_server_cognito_admin_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_cognito_admin_access]
aws_lambda_permission.allow_cognito_user_pool: Refreshing state... [id=AllowExecutionFromCognitoUserPool]
aws_lambda_permission.allow_s3_invoke: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_function_url.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_appsync_api_key.emenu_api_key: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4]
aws_s3_bucket_notification.image_upload_notification: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-emenu_datasource]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_appsync_resolver.delete_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDishType]
aws_appsync_resolver.delete_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDish]
aws_appsync_resolver.get_user_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUser]
aws_appsync_resolver.update_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDishType]
aws_appsync_resolver.update_restaurant_info_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantInfo]
aws_appsync_resolver.list_waiters_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listWaiters]
aws_appsync_resolver.place_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-placeOrder]
aws_appsync_resolver.toggle_dish_type_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishTypeStatus]
aws_appsync_resolver.list_orders_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listOrders]
aws_appsync_resolver.get_restaurant_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getRestaurant]
aws_appsync_resolver.register_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-registerWaiter]
aws_appsync_resolver.list_dish_types_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishTypes]
aws_appsync_resolver.create_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDish]
aws_appsync_resolver.update_restaurant_subscription_plan_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantSubscriptionPlan]
aws_appsync_resolver.dish_dishType_field: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Dish-dishType]
aws_appsync_resolver.get_user_by_cognito_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUserByCognito]
aws_appsync_resolver.invite_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-inviteWaiter]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishes]
aws_appsync_resolver.update_order_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateOrderStatus]
aws_appsync_resolver.update_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDish]
aws_appsync_resolver.checkout_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-checkoutOrder]
aws_appsync_resolver.create_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDishType]
aws_appsync_resolver.toggle_dish_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishStatus]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createRestaurant]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appsync_api_key.emenu_api_key will be updated in-place
  ~ resource "aws_appsync_api_key" "emenu_api_key" {
      ~ expires     = "2026-11-15T11:00:00Z" -> (known after apply)
        id          = "lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4"
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role_policy.image_processor_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "image_processor_policy" {
        id          = "image-processor-role-dev:image-processor-policy-dev"
        name        = "image-processor-policy-dev"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::emenu-restaurant-assets-dev/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.presigned_url_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "presigned_url_policy" {
        id          = "presigned-url-role-dev:presigned-url-policy-dev"
        name        = "presigned-url-policy-dev"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::emenu-restaurant-assets-dev/public/restaurant-logos/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.image_processor will be updated in-place
  ~ resource "aws_lambda_function" "image_processor" {
        id                             = "emenu-image-processor-dev"
      ~ last_modified                  = "2025-11-15T11:31:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "6530ae0e3bed2bb56371b6c69def7e88-3" -> "9f1de29540cb2d7d6a91c5a8cf19b18f-3"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "S3_BUCKET"                 = "emenu-restaurant-assets-dev" -> null
              + "S3_DISH_IMAGES_BUCKET"     = "emenu-dish-images-dev"
              + "S3_RESTAURANT_LOGO_BUCKET" = "emenu-restaurant-assets-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.presigned_url_generator will be updated in-place
  ~ resource "aws_lambda_function" "presigned_url_generator" {
        id                             = "emenu-presigned-url-generator-dev"
      ~ last_modified                  = "2025-11-15T11:31:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "f7abfb3add45e7a0b1b1868e0c269787" -> "a6413c77fed3def0f2bc4171a48a996b"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "S3_BUCKET"                 = "emenu-restaurant-assets-dev" -> null
              + "S3_DISH_IMAGES_BUCKET"     = "emenu-dish-images-dev"
              + "S3_RESTAURANT_LOGO_BUCKET" = "emenu-restaurant-assets-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_s3_invoke_dish_images will be created
  + resource "aws_lambda_permission" "allow_s3_invoke_dish_images" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "emenu-image-processor-dev"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromDishImagesBucket"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.dish_images will be created
  + resource "aws_s3_bucket" "dish_images" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "emenu-dish-images-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "Dish Images"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "Dish Images"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_cors_configuration.dish_images_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "dish_images_cors" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_notification.dish_image_upload_notification will be created
  + resource "aws_s3_bucket_notification" "dish_image_upload_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "public/dish-images/"
          + filter_suffix       = ".jpeg"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:ap-southeast-2:205930647566:function:emenu-image-processor-dev"
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "public/dish-images/"
          + filter_suffix       = ".jpg"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:ap-southeast-2:205930647566:function:emenu-image-processor-dev"
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "public/dish-images/"
          + filter_suffix       = ".png"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:ap-southeast-2:205930647566:function:emenu-image-processor-dev"
        }
    }

  # aws_s3_bucket_policy.dish_images_policy will be created
  + resource "aws_s3_bucket_policy" "dish_images_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.dish_images_pab will be created
  + resource "aws_s3_bucket_public_access_block" "dish_images_pab" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_server_side_encryption_configuration.dish_images_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "dish_images_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.dish_images_versioning will be created
  + resource "aws_s3_bucket_versioning" "dish_images_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 8 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  + dish_images_bucket_arn                = (known after apply)
  + dish_images_bucket_domain             = (known after apply)
  + dish_images_bucket_name               = "emenu-dish-images-dev"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
